app/controllers/imagesets_controller.rb

  def show
  	@imageset = Imageset.find(params[:id])
---
SELECT "imagesets".* FROM "imagesets" WHERE "imagesets"."id" = ? LIMIT 1  [["id", "14"]]

  def index
    @imagesets = Imageset.all
---
SELECT "imagesets".* FROM "imagesets"

  def create
  	@imageset = Imageset.new
    @imageset.save
    Delayed::Job.enqueue ImagesetJob.new(:access_token => session[:access_token], :id => @imageset.id)
      if @imageset.save
---
INSERT INTO "imagesets" ("averaged_image_content_type", "averaged_image_file_name", "averaged_image_file_size", "averaged_image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "delayed_jobs" ("created_at", "handler", "run_at", "updated_at") VALUES (?, ?, ?, ?)